# yolo11n-p2-C3TR.yaml
# YOLOv11 Nano 加强版: 融合 C3TR 自注意力机制 + P2 微小目标检测头

nc: 10 # VisDrone 类别数
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # 保持 Nano 级别的轻量化

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4 (提供给 P2 头的浅层高分辨率特征)
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3TR, [1024]]       # 8 (★ 修改点：在最深处替换为 Transformer 模块获取全局视野)
  - [-1, 1, SPPF, [1024, 5]]    # 9

head:
  # 注意：YOLOv11 官方结构中，颈部网络直接写在 head 下方
  - [-1, 1, C2PSA, [1024]]      # 10 (YOLOv11 特有的注意力增强模块)
  
  # --- 特征金字塔 上采样阶段 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]]   # 12 cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]]   # 15 cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 

  # ★ 新增 P2 上采样分支 (微小目标融合)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17 upsample P3 to P2
  - [[-1, 2], 1, Concat, [1]]   # 18 cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 19 (★ P2 检测特征层)

  # --- 特征金字塔 下采样阶段 (PANet) ---
  - [-1, 1, Conv, [128, 3, 2]]  # 20 downsample P2 to P3
  - [[-1, 16], 1, Concat, [1]]  # 21 cat neck P3
  - [-1, 2, C3k2, [256, False]] # 22 (★ P3 检测特征层)

  - [-1, 1, Conv, [256, 3, 2]]  # 23 downsample P3 to P4
  - [[-1, 13], 1, Concat, [1]]  # 24 cat neck P4
  - [-1, 2, C3k2, [512, False]] # 25 (★ P4 检测特征层)

  - [-1, 1, Conv, [512, 3, 2]]  # 26 downsample P4 to P5
  - [[-1, 10], 1, Concat, [1]]  # 27 cat neck P5
  - [-1, 2, C3k2, [1024, True]] # 28 (★ P5 检测特征层)

  # ★ 修改 Detect 层，输入 4 个特征层 [P2, P3, P4, P5]
  - [[19, 22, 25, 28], 1, Detect, [nc]] # 29 Detect(P2, P3, P4, P5)